app/controllers/foods_controller.rb

  def index
    # @user = current_user
    @user = User.first
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]

  def create
    @user = User.first
    @food = @user.foods.build(food_params)

    if @food.save
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "foods" ("name", "measuring_unit", "price", "quantity", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Chicken"], ["measuring_unit", nil], ["price", nil], ["quantity", 3], ["user_id", 1], ["created_at", "2023-06-27 15:44:28.627550"], ["updated_at", "2023-06-27 15:44:28.627550"]]